In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.2.4-cp38-cp38-win_amd64.whl (9.3 MB)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\tibame_t14\desktop\pythonetl\classtest\venv\lib\site-packages (from pandas) (2.8.1)
Collecting numpy>=1.16.5
  Downloading numpy-1.20.3-cp38-cp38-win_amd64.whl (13.7 MB)
Collecting pytz>=2017.3
  Downloading pytz-2021.1-py2.py3-none-any.whl (510 kB)
Requirement already satisfied: six>=1.5 in c:\users\tibame_t14\desktop\pythonetl\classtest\venv\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.20.3 pandas-1.2.4 pytz-2021.1

In [4]:
import pandas as pd

columns = ['Name', 'Age', 'Height']
df = pd.DataFrame(columns=columns)

df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ['Vic', '33', '167']
df

  Name Age Height
0  Vic  33    167

In [6]:
df.loc[1] = ['Ivy', '33', '165']
df.loc[2] = ['Alice', '30', '160']
df

    Name Age Height
0    Vic  33    167
1    Ivy  33    165
2  Alice  30    160

In [7]:
df['Weight'] = ['64', '50', '45']
df

    Name Age Height Weight
0    Vic  33    167     64
1    Ivy  33    165     50
2  Alice  30    160     45

In [8]:
df.drop(['Weight'], axis=1)

    Name Age Height
0    Vic  33    167
1    Ivy  33    165
2  Alice  30    160

In [9]:
df

    Name Age Height Weight
0    Vic  33    167     64
1    Ivy  33    165     50
2  Alice  30    160     45

In [10]:
df = df.drop(['Weight'], axis=1)

In [11]:
df

    Name Age Height
0    Vic  33    167
1    Ivy  33    165
2  Alice  30    160

In [12]:
df.drop(2) # 等同 df.drop(2, axis=0)

  Name Age Height
0  Vic  33    167
1  Ivy  33    165

In [13]:
df['Age'][0] = '20'
df

    Name Age Height
0    Vic  20    167
1    Ivy  33    165
2  Alice  30    160

In [14]:
df['Age'] = '50' #沒有指定位置會把整欄資料改變
df

    Name Age Height
0    Vic  50    167
1    Ivy  50    165
2  Alice  50    160

In [16]:
df.loc[1] = 'aaa' # 列也相同
df

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160

In [17]:
columns = ['Name', 'Age', 'Height']
data = [
    ['Jack', '29', '77'],
    ['Merry', '23', '70']
]

df2 = pd.DataFrame(data=data, columns=columns)
df2

    Name Age Height
0   Jack  29     77
1  Merry  23     70

In [18]:
df.append(df2)

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160
0   Jack   29     77
1  Merry   23     70

In [19]:
df

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160

In [20]:
df3 = df.append(df2) # 將 df1 與 df2 表格合併, 建立 df3 表格
df3

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160
0   Jack   29     77
1  Merry   23     70

In [21]:
df3.reset_index() # 賦予表格新的index

   index   Name  Age Height
0      0    Vic   50    167
1      1    aaa  aaa    aaa
2      2  Alice   50    160
3      0   Jack   29     77
4      1  Merry   23     70

In [22]:
df3.reset_index(drop=True)

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160
3   Jack   29     77
4  Merry   23     70

In [23]:
df3

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160
0   Jack   29     77
1  Merry   23     70

In [25]:
df3 = df3.reset_index(drop=True) # 重新排序新的index, 並刪除舊的index, 並更新複寫df3表格資料
df3

    Name  Age Height
0    Vic   50    167
1    aaa  aaa    aaa
2  Alice   50    160
3   Jack   29     77
4  Merry   23     70

In [26]:
df3['Name']

0      Vic
1      aaa
2    Alice
3     Jack
4    Merry
Name: Name, dtype: object